Repository: MenenTechnologies/MenenTechnologies.github.io
Catalog: root/loc/ts/*/index.html.po
Languages: es

source: Pablo - Personal Portfolio
es: Pablo - Portafolio personal

source: Hi, I'm Pablo
es: Hola, soy Pablo

source: Localization &amp; UI Software Engineer
es: Ingeniero de software de localización y de interfaz de usuario

source: Game Developer in my free time
es: Desarrollador de videojuegos en mi tiempo libre

source: Double Master in Industrials and Microelectronics at UPM &amp; IIT
es: Doble Máster en Industriales y Microelectrónica en la UPM y el IIT

source: LinkedIn button link
es: Botón con enlace a LinkedIn

source: Github button link
es: Botón con enlace a Github

source: Bitbucket button link
es: Botón con enlace a Bitbucket

source: Feel free to take a look around
es: Siéntase libre de echar un vistazo

source: picture of Pablo
es: foto de Pablo
