Repository: MenenTechnologies/MenenTechnologies.github.io
Catalog: root/loc/ts/*/projects.json.po
Languages: es

source: Cache remover extension for Google Chrome. It gathers all cookies stored by the current active website, displays them in a tree view and allows to remove any or all of them.
es: Extensión de Google Chrome que elimina memoria caché. Recoge todas las cookies almacenadas por el sitio web activo en ese momento, las muestra en una vista de árbol y permite eliminar alguna o todas ellas.

source: Cookie Devourer
es: Devorador de cookies

source: Game in first person in which you need to fight the minotaur and find the exit of the maze.
es: Juego en primera persona en el que tienes que luchar contra el minotauro y encontrar la salida del laberinto.

source: Minotaur's Maze
es: Laberinto del minotauro

source: Website that highlights my experience and personal projects. It is localized to several languages.
es: Sitio web que destaca mi experiencia y mis proyectos personales. Está localizada a varios idiomas.

source: This website
es: Esta página web

source: Relaxing game for the LEGO Ideas Game Jam. Grow different types of crops and harvest them to earn money.
es: Relajante juego para la competición de videojuegos LEGO Ideas. Haz crecer diferentes tipos de cultivos y recógelos para ganar dinero.

source: LEGO Farm
es: Granja LEGO

source: First game I made to practice my new acquired skills in Unity.
es: Primer juego que hice para practicar mis nuevas habilidades adquiridas en Unity.

source: Asteroids
es: Asteroides

source: Game for the 44th edition of the Ludum Dare game jam, developed in group with some folks from the Baltimore Indie Game Developers Group. I did most of the programming and set up the scenes in Unity.
es: Juego para la 44ª edición de la competición de videojuegos conocida como Ludum Dare, desarrollado en grupo con algunas personas del grupo de desarrolladores de videojuegos indie de Baltimore. Yo realicé la mayor parte de la programación y monté las escenas en Unity.

source: Ludum Dare 44: Loose Change
es: Ludum Dare 44: Dinero Suelto

source: Game
es: Juego

source: In Development
es: En desarrollo

source: I like to keep improving and learning new skills. I look for skills that are fun, useful and complementary to my job as a front-end software engineer. This is a list of projects that I have created in the last years during my free time to practice those skills.
es: Me gusta seguir mejorando y aprendiendo nuevas habilidades. Busco habilidades que sean divertidas, útiles y complementarias a mi trabajo como ingeniero de software front-end. Esta es una lista de proyectos que he creado en los últimos años durante mi tiempo libre para practicar esas habilidades.

source: Play
es: Jugar

source: See
es: Ver

source: Skills:
es: Habilidades:

source: Type:
es: Tipo:

source: Year:
es: Año:
